Revit 2026 API

# BuiltInFailuresColorFillFailures Class

---

Failures about ColorFill.

SystemObject Autodesk.Revit.DBBuiltInFailuresColorFillFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ColorFillFailures
```
```vb
Public NotInheritable Class ColorFillFailures
```
```cpp
public ref class ColorFillFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ColorFillFailures = class end
```

The BuiltInFailuresColorFillFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OnlyOneColorFillNonPlan | A Color Fill Legend can only be placed in a Floor Plan View or a Section View. |
|  | SymtemColorFillLegendNotAllowed | [Category name] Color Fill Legend can only be placed in a Floor Plan View. |

#### Reference

Autodesk.Revit.DB Namespace